# **Introduction to Pandas**
---



* Open-source Python library designed for data manipulation and analysis
* Provides data structures like Series and DataFrames to easily clean, transform and analyze large datasets
* Offers functions for data transformation, aggregation and visualization

## **Uses of Pandas**
* Reading and writing data from various file formats like CSV, Excel and SQL databases.
* Cleaning and preparing data by handling missing values and filtering entries.
* Merging and joining multiple datasets seamlessly.
* Conducting statistical analysis and generating descriptive statistics.
* Visualizing data with integrated plotting capabilities.

## **Pandas vs Excel**

* Can handle large sized data efficiently, excel is prone to crashes
* Can automate using Python scripts
* Data cleaning easier using built-in functions
* Integration with Machine Learning libraries

## **Installing and Importing Pandas**

In [ ]:
pip install pandas

In [8]:
import pandas as pd

# **Pandas Series & DataFrames**
---

## **Data Structures in Pandas Library**

**1. Pandas Series**

* Like a single column of data in a spreadsheet
* 1D labelled array capable of holding data of any type
* Created by loading the datasets from existing storage like SQL Database, a CSV file or an Excel file
* Can be created from lists, dictionaries, scalar values, etc.

In [9]:
import pandas as pd
import numpy as np

"""pd.Series(data: Scalar | _DataLike[Any] | Mapping[HashableT1@__new__, Any] | BaseGroupBy[Unknown] | NaTType | NAType | None = ...,
    index: AxesData[Unknown] | None = ...,
    dtype: Dtype = ...,
    name: Hashable = ...,
    copy: bool = ...
))"""

ser = pd.Series()
print("Pandas Series: ", ser)

ser = pd.Series(dtype=float)
print("Pandas Series: ", ser)

# Creating pandas series using numpy array
data = np.array(['p', 'a', 'n', 'd', 'a', 's'])
ser1 = pd.Series(data)
ser2=pd.Series([1.0,2.0,30.0],dtype="float64")
print("Pandas Series:")
print(ser1)
print(ser2)

Pandas Series:  Series([], dtype: object)
Pandas Series:  Series([], dtype: float64)
Pandas Series:
0    p
1    a
2    n
3    d
4    a
5    s
dtype: object
0     1.0
1     2.0
2    30.0
dtype: float64

In [14]:
data = np.array(['p', 'a', 'n', 'd', 'a', 's'])
ser = pd.Series(data, index = [10,11,12,13,14,15], name="example")
print(ser)

10    p
11    a
12    n
13    d
14    a
15    s
Name: example, dtype: object

In [16]:
df = pd.read_csv("nba.csv")
pd.set_option('display.max_columns',None)
pd.set_option('display.width',10000)
pd.set_option('display.max_colwidth',None)

print(df)
print(df.columns)
df.columns=df.columns.str.replace(' ','')
print(df.columns)

ser=df['Name']
print(ser)

     Name                       Team                     Number   Position   Age    Height   Weight   College                     Salary
0    Avery Bradley              Boston Celtics              0.0   PG         25.0   6-2       180.0   Texas                    7730337.0
1    Jae Crowder                Boston Celtics             99.0   SF         25.0   6-6       235.0   Marquette                6796117.0
2    John Holland               Boston Celtics             30.0   SG         27.0   6-5       205.0   Boston University
3    R.J. Hunter                Boston Celtics             28.0   SG         22.0   6-5       185.0   Georgia State            1148640.0
4    Jonas Jerebko              Boston Celtics              8.0   PF         29.0   6-10      231.0                            5000000.0
..                        ...                      ...      ...        ...    ...      ...      ...                     ...          ...
453  Shelvin Mack               Utah Jazz                   8.0   PG         26.0   6-3       203.0   Butler                   2433333.0
454  Raul Neto                  Utah Jazz                  25.0   PG         24.0   6-1       179.0                             900000.0
455  Tibor Pleiss               Utah Jazz                  21.0   C          26.0   7-3       256.0                            2900000.0
456  Jeff Withey                Utah Jazz                  24.0   C          26.0   7-0       231.0   Kansas                    947276.0
457

[458 rows x 9 columns]
Index(['Name                    ', ' Team                  ', ' Number', ' Position', ' Age ', ' Height', ' Weight', ' College              ', ' Salary'], dtype='object')
Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight', 'College', 'Salary'], dtype='object')
0      Avery Bradley
1      Jae Crowder
2      John Holland
3      R.J. Hunter
4      Jonas Jerebko
                 ...
453    Shelvin Mack
454    Raul Neto
455    Tibor Pleiss
456    Jeff Withey
457
Name: Name, Length: 458, dtype: object

In [17]:
# We access the element of series using .loc[] function.

ser.loc[3:6]

3    R.J. Hunter
4    Jonas Jerebko
5    Amir Johnson
6    Jordan Mickey
Name: Name, dtype: object

**Exercise**: Display the entries 10-15 from the Team column

In [18]:
df['Team'].loc[10:15]

10     Boston Celtics
11     Boston Celtics
12     Boston Celtics
13     Boston Celtics
14     Boston Celtics
15     Brooklyn Nets
Name: Team, dtype: object

In [19]:
df['Team'].iloc[10]

' Boston Celtics        '

**Operations on Pandas Series**
* Addition, subtraction, division, multiplication

In [20]:
ser1 = pd.Series([1, 2, 3], index=['A', 'B', 'C'])
ser2 = pd.Series([4, 6, 0], index=['A', 'B', 'C'])
print(ser1)
print(ser2)
df_sum = ser1.add(ser2)
print(df_sum)

A    1
B    2
C    3
dtype: int64
A    4
B    6
C    0
dtype: int64
A    5
B    8
C    3
dtype: int64

In [21]:
df_sum = ser1.sub(ser2)
print(df_sum)

A   -3
B   -4
C    3
dtype: int64

In [ ]:
df_sum = ser1.mul(ser2)
print(df_sum)

In [ ]:
df_sum = ser1.div(ser2)
print(df_sum)

**Exercise**: Find the ratio of Weight to Age from the nba dataset

In [ ]:
print(df['Weight'])
print(df['Age'])
df['Weight'].div(df['Age'])

0        180.0
1        235.0
2        205.0
3        185.0
4        231.0
        ...
453      203.0
454      179.0
455      256.0
456      231.0
457
Name: Weight, Length: 458, dtype: object
0       25.0
1       25.0
2       27.0
3       22.0
4       29.0
       ...
453     26.0
454     24.0
455     26.0
456     26.0
457
Name: Age, Length: 458, dtype: object

**Creating a series from a Dictionary**

In [ ]:
data_dict = {'numPy': 10, 'and': 20, 'pandas': 30}

ser = pd.Series(data_dict, name="pandas_from_dict")
print(ser)

**Creating a Series Using NumPy Functions**

In [ ]:
ser = pd.Series(np.linspace(1, 10, 5))
print(ser)

**Exercise**: Create a Pandas series with the following values:

1: 1  
2: 4  
3: 9  
4: 16  
5: 25  

**Hint**: Use arange or linspace

In [ ]:
print(pd.Series(np.arange(1, 6, 1)*np.arange(1, 6, 1)))

s = (pd.Series(np.square(np.arange(1, 6, 1)), index=[1,2,3,4,5]))
print(s)
print(s.iloc[2])

**Creating a Series Using range()**

In [ ]:
ser = pd.Series(range(5, 15))
print(ser)

**2. Pandas Dataframe**
* 2D data structure with labelled axes (rows and columns)
* Created by loading the datasets from existing storage like SQL Database, a CSV file or an Excel file
* Can be created from lists, dictionaries, scalar values, etc.

In [ ]:
df = pd.DataFrame()
print(df)

**Creating a DataFrame from a List**
* Each item in the list becomes a row
* The DataFrame consists of a single unnamed column

In [ ]:
lst = ['numPy', 'dataframe', 'Pandas', 'series', 'python', 'excel', 'csv']

df = pd.DataFrame(lst)
print(df)

**Creating DataFrame from Numpy Array**

In [ ]:
data = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df = pd.DataFrame(data)
print(df)

# shape function will give info of how many columns and rows present in the dataframe
print(f"\nShape of df = {df.shape}")

In [ ]:
pd.DataFrame(data, columns=['A', 'B', 'C'], index=[1,2,3])

**Creating a DataFrame from a Dictionary**

In [ ]:
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}

# Keys become column names
s=pd.Series(dict)
df = pd.DataFrame(dict)

print(df)
print(s)

**Creating a DataFrame from a List of Dictionaries**

In [ ]:
data = [{'a': 1, 'b': 2, 'c': 3},
        {'a': 10, 'b': 20, 'c': 30}]

# Creates DataFrame.
df = pd.DataFrame(data)

print(df)

**Creating a DataFrame from a Dictionary of Series**

In [ ]:
# Initialize data to Dicts of series.
d = {'one': pd.Series([10, 20, 30, 40],
                      index=['a', 'b', 'c', 'd']),
     'two': pd.Series([10, 20, 30, 40],
                      index=['a', 'b', 'c', 'd'])}

# creates Dataframe.
df = pd.DataFrame(d)

print(df)

**Pandas Dataframe/Series.head() method**
* Used to return top n (5 by default) rows of a data frame or series.

In [ ]:
# making data frame
data = pd.read_csv("nba.csv")

# calling head() method
# storing in new variable
data.head()

In [ ]:
data.head(9)

In [ ]:
series = data['Name']
series.head(8)

**Pandas Dataframe/Series.tail() method**
* Helps us see the last n rows of a DataFrame or Series.

In [ ]:
data.tail()

In [ ]:
data.tail(12)

**Dealing with Columns and Rows**

**1. Multi-Column Selection**

In [ ]:
df = pd.DataFrame(data)
df[['Height', 'Weight']]

**Exercise**: Print the top 7 rows of Height and Weight column

In [ ]:
data[['Height', 'Weight']].head(7)

**2. Column Addition**

In [ ]:
# Define a dictionary containing employee data
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

# Convert the dictionary into DataFrame
df = pd.DataFrame(data1)
print(df)
print('----------------------')
# Declare a list that is to be converted into a column
address = ['Delhi', 'Bangalore', 'Chennai', 'Patna']

# Using 'Address' as the column name and equating it to the list
df['Address'] = address
print(df)

In [ ]:
df = df.assign(Holiday = ['NewYork', 'Chicago', 'Boston', 'Miami'])
df

In [ ]:
df.insert(2, "Mark", [86, 91, 56, 70])
df

**3. Column Deletion**

In [ ]:
# making data frame from csv file
pd.set_option('display.max_columns', None)
pd.set_option('display.width', 10000)
pd.set_option('display.max_colwidth', None)

data = pd.read_csv("nba.csv")
print(data.head(2))
# dropping passed columns
data.drop(["Team", "Weight"], axis = 1, inplace = True)
print("\n-----New Data-----\n")
# display
print(data.head(2))

print("\n\n\n\n", data.loc[2:5])

**4. Row Selection**

In [12]:
data = pd.read_csv("nba.csv", index_col ="Name")

print(data.head(4))
print('\n\n\n')
# retrieving row by loc method
first = data.loc["Jae Crowder"]
second = data.iloc[0]

print(first, "\n\n\n", second)

ValueError: Index Name invalid

In [13]:
data.loc[['Avery Bradley', 'R.J. Hunter']]

AttributeError: 'numpy.ndarray' object has no attribute 'loc'

In [ ]:
data.loc[['Avery Bradley', 'R.J. Hunter'], ['Height', 'Weight']]

**2. Row Addition**

In [27]:
import pandas as pd
df = pd.read_csv("nba.csv")
print(df.head(2))
print("\n\n\n")
new_row = pd.DataFrame({'Name':'Sam', 'Team':'Boston', 'Number':3,
                           'Position':'PG', 'Age':33, 'Height':'6-2',
                        ' Weight':189, 'College':'MIT', 'Salary':99999}, index=[0])
# simply concatenate both dataframes
df = pd.concat([new_row, df])
print(df.head(2))

   Name                       Team                     Number   Position   Age    Height   Weight   College                     Salary
0  Avery Bradley              Boston Celtics              0.0   PG         25.0   6-2       180.0   Texas                    7730337.0
1  Jae Crowder                Boston Celtics             99.0   SF         25.0   6-6       235.0   Marquette                6796117.0




  Name    Team  Number Position   Age Height   Weight College   Salary  Name                       Team                     Number   Position   Age    Height   College                     Salary
0  Sam  Boston     3.0       PG  33.0    6-2      189     MIT  99999.0                       NaN                      NaN      NaN        NaN    NaN      NaN                     NaN          NaN
0  NaN     NaN     NaN      NaN   NaN    NaN    180.0     NaN      NaN  Avery Bradley              Boston Celtics              0.0   PG         25.0   6-2      Texas                    7730337.0

In [28]:
df = pd.read_csv("nba.csv")
print(df.head(2))
print("\n\n")
con = pd.concat([new_row, df])
print("\n\n")
print(con)

df = con.reset_index(drop=False)
print("\n\n\n", df.head(2))

   Name                       Team                     Number   Position   Age    Height   Weight   College                     Salary
0  Avery Bradley              Boston Celtics              0.0   PG         25.0   6-2       180.0   Texas                    7730337.0
1  Jae Crowder                Boston Celtics             99.0   SF         25.0   6-6       235.0   Marquette                6796117.0






    Name    Team  Number Position   Age Height   Weight College   Salary  Name                       Team                     Number   Position   Age    Height   College                     Salary
0    Sam  Boston     3.0       PG  33.0    6-2      189     MIT  99999.0                       NaN                      NaN      NaN        NaN    NaN      NaN                     NaN          NaN
0    NaN     NaN     NaN      NaN   NaN    NaN    180.0     NaN      NaN  Avery Bradley              Boston Celtics              0.0   PG         25.0   6-2      Texas                    7730337.0
1    NaN     NaN     NaN      NaN   NaN    NaN    235.0     NaN      NaN  Jae Crowder                Boston Celtics             99.0   SF         25.0   6-6      Marquette                6796117.0
2    NaN     NaN     NaN      NaN   NaN    NaN    205.0     NaN      NaN  John Holland               Boston Celtics             30.0   SG         27.0   6-5      Boston University
3    NaN     NaN     NaN      NaN   NaN    NaN    185.0     NaN      NaN  R.J. Hunter                Boston Celtics             28.0   SG         22.0   6-5      Georgia State            1148640.0
..   ...     ...     ...      ...   ...    ...      ...     ...      ...                       ...                      ...      ...        ...    ...      ...                     ...          ...
453  NaN     NaN     NaN      NaN   NaN    NaN    203.0     NaN      NaN  Shelvin Mack               Utah Jazz                   8.0   PG         26.0   6-3      Butler                   2433333.0
454  NaN     NaN     NaN      NaN   NaN    NaN    179.0     NaN      NaN  Raul Neto                  Utah Jazz                  25.0   PG         24.0   6-1                                900000.0
455  NaN     NaN     NaN      NaN   NaN    NaN    256.0     NaN      NaN  Tibor Pleiss               Utah Jazz                  21.0   C          26.0   7-3                               2900000.0
456  NaN     NaN     NaN      NaN   NaN    NaN    231.0     NaN      NaN  Jeff Withey                Utah Jazz                  24.0   C          26.0   7-0      Kansas                    947276.0
457  NaN     NaN     NaN      NaN   NaN    NaN              NaN      NaN

[459 rows x 17 columns]



    index Name    Team  Number Position   Age Height   Weight College   Salary  Name                       Team                     Number   Position   Age    Height   College                     Salary
0      0  Sam  Boston     3.0       PG  33.0    6-2      189     MIT  99999.0                       NaN                      NaN      NaN        NaN    NaN      NaN                     NaN          NaN
1      0  NaN     NaN     NaN      NaN   NaN    NaN    180.0     NaN      NaN  Avery Bradley              Boston Celtics              0.0   PG         25.0   6-2      Texas                    7730337.0

In [ ]:
pd.concat([df, new_row]).reset_index(drop = True).tail(2)

**3. Row Deletion**

In [31]:
data = pd.read_csv("nba.csv")
print(data.head(6))
print("\n\n\n")

data.drop([1, 3, 4], inplace=True)
# display
print(data.head(6))
data.drop([' Weight'],axis=1,inplace=True)
print(data.head(5))

   Name                       Team                     Number   Position   Age    Height   Weight   College                     Salary
0  Avery Bradley              Boston Celtics              0.0   PG         25.0   6-2       180.0   Texas                    7730337.0
1  Jae Crowder                Boston Celtics             99.0   SF         25.0   6-6       235.0   Marquette                6796117.0
2  John Holland               Boston Celtics             30.0   SG         27.0   6-5       205.0   Boston University
3  R.J. Hunter                Boston Celtics             28.0   SG         22.0   6-5       185.0   Georgia State            1148640.0
4  Jonas Jerebko              Boston Celtics              8.0   PF         29.0   6-10      231.0                            5000000.0
5  Amir Johnson               Boston Celtics             90.0   PF         29.0   6-9       240.0                           12000000.0




   Name                       Team                     Number   Position   Age    Height   Weight   College                     Salary
0  Avery Bradley              Boston Celtics              0.0   PG         25.0   6-2       180.0   Texas                    7730337.0
2  John Holland               Boston Celtics             30.0   SG         27.0   6-5       205.0   Boston University
5  Amir Johnson               Boston Celtics             90.0   PF         29.0   6-9       240.0                           12000000.0
6  Jordan Mickey              Boston Celtics             55.0   PF         21.0   6-8       235.0   LSU                      1170960.0
7  Kelly Olynyk               Boston Celtics             41.0   C          25.0   7-0       238.0   Gonzaga                  2165160.0
8  Terry Rozier               Boston Celtics             12.0   PG         22.0   6-2       190.0   Louisville               1824360.0
   Name                       Team                     Number   Position   Age    Height   College                     Salary
0  Avery Bradley              Boston Celtics              0.0   PG         25.0   6-2      Texas                    7730337.0
2  John Holland               Boston Celtics             30.0   SG         27.0   6-5      Boston University
5  Amir Johnson               Boston Celtics             90.0   PF         29.0   6-9                              12000000.0
6  Jordan Mickey              Boston Celtics             55.0   PF         21.0   6-8      LSU                      1170960.0
7  Kelly Olynyk               Boston Celtics             41.0   C          25.0   7-0      Gonzaga                  2165160.0

In [ ]:
data.reset_index(drop=True)

# **Missing Values, Handling Missing Values**


---

**Checking Missing Values in Pandas** \\
**1. Using isnull()**

In [32]:
d = {'First Score': [100, 90, np.nan, 89],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}
df = pd.DataFrame(d)
print(df)
print('\n\n')
mv = df.isnull()
print(mv)

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0           NaN         98.0



   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

**2. Using notnull()**

In [33]:
nmv = df.notnull()

print(nmv)

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

**Filling Missing Values in Pandas** \\
**1. Using fillna()**

In [34]:
print(df)
print('\n')
print(df.fillna(0))

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0           NaN         98.0


   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         89.0           0.0         98.0

**2. Using ffill()**

In [35]:
print(df)
# ffill will propogate the last observed value along the axis
df.ffill()

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0           NaN         98.0

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         89.0          56.0         98.0

In [36]:
df.ffill(axis=1)

   First Score  Second Score  Third Score
0        100.0          30.0         30.0
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0          89.0         98.0

**3. Using bfill()**

In [37]:
print(df)
df.bfill()

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0           NaN         98.0

   First Score  Second Score  Third Score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         89.0          56.0         80.0
3         89.0           NaN         98.0

In [ ]:
print(df)
df.bfill(axis=1)

**4. Using replace()**

In [38]:
df.replace(to_replace=np.nan, value=-99)

   First Score  Second Score  Third Score
0        100.0          30.0        -99.0
1         90.0          45.0         40.0
2        -99.0          56.0         80.0
3         89.0         -99.0         98.0

In [39]:
df.replace(to_replace=30, value=-99)

   First Score  Second Score  Third Score
0        100.0         -99.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0           NaN         98.0

**Dropping Missing Values in Pandas**

**1. Dropping Rows with At Least One Null Value**

In [40]:
print(df)
print("\n\n\n")

# Dropping row which has atleat one NaN in a row
df.dropna()

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0           NaN         98.0

   First Score  Second Score  Third Score
1         90.0          45.0         40.0

**2. Dropping Rows with All Null Values**

In [41]:
print(df,"\n\n\n")

# Drop rows which has all value as NaN
print(df.dropna(how='all'))

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0           NaN         98.0



   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         89.0           NaN         98.0

**3. Dropping Columns with At Least One Null Value**

In [42]:
dict = {'First Score': [100, np.nan, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score': [52, np.nan, 80, 98],
        'Fourth Score': [60, 67, 68, 65],
        'Fifth Score': [np.nan, np.nan, np.nan, np.nan]}
df = pd.DataFrame(dict)
print(df)
print("\n\n\n")

# Dropping all column which has atleast 1 NaN value
print(df.dropna(axis=1))

   First Score  Second Score  Third Score  Fourth Score  Fifth Score
0        100.0          30.0         52.0            60          NaN
1          NaN           NaN          NaN            67          NaN
2          NaN          45.0         80.0            68          NaN
3         95.0          56.0         98.0            65          NaN




   Fourth Score
0            60
1            67
2            68
3            65

**Exercise**: Drop columns with all null values

In [44]:
print(df,"\n\n\n")

# Drop columns which has all value as Nan
df.dropna(how='all', axis=1)

   First Score  Second Score  Third Score  Fourth Score  Fifth Score
0        100.0          30.0         52.0            60          NaN
1          NaN           NaN          NaN            67          NaN
2          NaN          45.0         80.0            68          NaN
3         95.0          56.0         98.0            65          NaN

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0         52.0            60
1          NaN           NaN          NaN            67
2          NaN          45.0         80.0            68
3         95.0          56.0         98.0            65

# **Data Operations**

---


**Pandas GroupBy**
* Motivation : Books of different genres in a Library, departments in an office etc.
* Group data by one or more categories and then apply different functions to those groups

**Splitting Data into Groups**
* Refers to dividing the dataset into groups based on a particular condition or key

In [2]:
import pandas as pd
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
                 'Gaurav', 'Anuj', 'Princi', 'Abhi', 'Jai'],
        'Age':[27, 24, 22, 32,
               33, 36, 27, 32, 29],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh', 'Chennai'],
        'Qualification':['MSc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA', 'MSc']}
df = pd.DataFrame(data1)
print(df, "\n\n\n")
print(df.groupby('Name').groups)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           MSc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA
8     Jai   29    Chennai           MSc



{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2, 8], 'Princi': [3, 6]}

In [9]:
# Group keys are sorted by default
gk = df.groupby('Name')

print("group:",gk)
print(gk.size())

group: <pandas.core.groupby.generic.DataFrameGroupBy object at 0x10f45a330>
Name
Abhi      1
Anuj      2
Gaurav    1
Jai       3
Princi    2
dtype: int64

In [11]:
# This function will get 1st index of all the groups and return a datafram
gk.first()

        Age  Address Qualification
Name
Abhi     32  Aligarh            MA
Anuj     24   Kanpur            MA
Gaurav   33  Jaunpur        B.Tech
Jai      27   Nagpur           MSc
Princi   32  Kannuaj           Phd

In [10]:
gk['Age'].sum()

Name
Abhi      32
Anuj      60
Gaurav    33
Jai       78
Princi    59
Name: Age, dtype: int64

In [ ]:

# groupby function by default disable sorting, to improve performance we can
# disable sorting
gk = df.groupby(['Name'], sort=False)
gk['Age'].sum()

**Exercise**: Group the above data by address and print the size and first entry in each group.

In [ ]:
gk = df.groupby('Address')
print(gk.groups)
print('-----------------------------------')
print(gk.size())
print('-----------------------------------')
print(gk.first())

In [12]:
print(df.groupby(['Name', 'Qualification']).groups)

{('Abhi', 'MA'): [7], ('Anuj', 'B.com'): [5], ('Anuj', 'MA'): [1], ('Gaurav', 'B.Tech'): [4], ('Jai', 'MCA'): [2], ('Jai', 'MSc'): [0, 8], ('Princi', 'Msc'): [6], ('Princi', 'Phd'): [3]}

**How can we Iterate through groups ?**

**Selecting a group**

In [14]:
grp = df.groupby('Name')
grp.get_group('Jai')

  Name  Age    Address Qualification
0  Jai   27     Nagpur           MSc
2  Jai   22  Allahabad           MCA
8  Jai   29    Chennai           MSc

**Applying Functions to Groups**
* After splitting a data into a group we apply a function to each group

**1. Aggregation**
* It allows us to find a summary statistic for each group like summing or averaging values

In [15]:
grp1 = df.groupby('Name')
print(grp1.groups)
print(grp1['Age'].aggregate(["sum", "mean", "std"]))

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2, 8], 'Princi': [3, 6]}
        sum  mean       std
Name
Abhi     32  32.0       NaN
Anuj     60  30.0  8.485281
Gaurav   33  33.0       NaN
Jai      78  26.0  3.605551
Princi   59  29.5  3.535534

In [ ]:
grp1 = df.groupby(['Name', 'Qualification'])
grp1['Age'].aggregate("sum")

**2. Transformation**
* In this we perform some group-specific computations and return a result with the same index as the original data.

In [16]:
square = lambda x: x * x
print(square(5))   # Output: 25

25

In [17]:
df = df.assign(Score=[23, 34, 35, 45, 47, 50, 52, 53, 44])
print(df)
print('------------------------------------------------')
grp2 = df.groupby('Name')
sc = lambda x: (x*x)
print(grp2['Age'].aggregate(["mean", "std"]))
print('------------------------------------------------')
print(grp2['Age'].transform(sc))

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           MSc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53
8     Jai   29    Chennai           MSc     44
------------------------------------------------
        mean       std
Name
Abhi    32.0       NaN
Anuj    30.0  8.485281
Gaurav  33.0       NaN
Jai     26.0  3.605551
Princi  29.5  3.535534
------------------------------------------------
0     729
1     576
2     484
3    1024
4    1089
5    1296
6     729
7    1024
8     841
Name: Age, dtype: int64

**3. Filtration**
* Used to discard groups based on a condition

In [21]:

print(grp2.groups)
print(grp2.filter(lambda x: len(x) >= 2))
# print(grp2)

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2, 8], 'Princi': [3, 6]}
     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           MSc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
8     Jai   29    Chennai           MSc     44

**Grouping Rows in pandas**

In [22]:
example = {'Team':['Arsenal', 'Manchester United', 'Arsenal',
                   'Arsenal', 'Chelsea', 'Manchester United',
                   'Manchester United', 'Chelsea', 'Chelsea', 'Chelsea'],

           'Player':['Ozil', 'Pogba', 'Lucas', 'Aubameyang',
                       'Hazard', 'Mata', 'Lukaku', 'Morata',
                                         'Giroud', 'Kante'],

           'Goals':[5, 3, 6, 4, 9, 2, 0, 5, 2, 3] }

df = pd.DataFrame(example)

print(df)

                Team      Player  Goals
0            Arsenal        Ozil      5
1  Manchester United       Pogba      3
2            Arsenal       Lucas      6
3            Arsenal  Aubameyang      4
4            Chelsea      Hazard      9
5  Manchester United        Mata      2
6  Manchester United      Lukaku      0
7            Chelsea      Morata      5
8            Chelsea      Giroud      2
9            Chelsea       Kante      3

In [ ]:
# Objective: Find out aggregate of goals per team

#method self
grp1=df.groupby('Team')  #?here it showing error if .groups is used 
print(grp1['Goals'].aggregate(['sum','mean']))

#sirs method
total_goals = df['Goals'].groupby(df['Team'])  #?how is it working

# printing the means value
print(total_goals.mean())
print('------------------------------------------------')
print(total_goals.sum())

                   sum      mean
Team
Arsenal             15  5.000000
Chelsea             19  4.750000
Manchester United    5  1.666667
Team
Arsenal              5.000000
Chelsea              4.750000
Manchester United    1.666667
Name: Goals, dtype: float64
------------------------------------------------
Team
Arsenal              15
Chelsea              19
Manchester United     5
Name: Goals, dtype: int64

In [ ]:
example = {'Team':['Australia', 'England', 'South Africa',
                   'Australia', 'England', 'India', 'India',
                        'South Africa', 'England', 'India'],

           'Player':['Ricky Ponting', 'Joe Root', 'Hashim Amla',
                     'David Warner', 'Jos Buttler', 'Virat Kohli',
                     'Rohit Sharma', 'David Miller', 'Eoin Morgan',
                                                 'Dinesh Karthik'],

          'Runs':[345, 336, 689, 490, 989, 672, 560, 455, 342, 376],

          'Salary':[34500, 33600, 68900, 49000, 98899,
                    67562, 56760, 45675, 34542, 31176] }

df = pd.DataFrame(example)

**Exercise**: Find the mean salary per team.

In [ ]:
total_salary = df['Salary'].groupby(df['Team'])

# printing the means value
print(total_salary.mean())

In [ ]:
data = {
    'Store': ['A', 'A', 'B', 'B', 'A', 'B'],
    'Product': ['Apple', 'Banana', 'Apple', 'Banana', 'Apple', 'Banana'],
    'Sales': [100, 150, 200, 100, 120, 180],
    'Quantity': [10, 20, 30, 40, 15, 35]
}

df = pd.DataFrame(data)
display(df)
# Obj: Find the total sales and average quantity sold per store
# Grouping by 'Store' and applying different aggregation functions
agg_dict = {
    'Sales': 'sum',          # Sum the 'Sales' column
    'Quantity': 'mean'       # Find the mean of the 'Quantity' column
}

result = df.groupby('Store').agg(agg_dict)

display(result)

**Exercise**: Find the total and mean sales and maximum and minimum quantity sold per store

In [ ]:
agg_dict = {
    'Sales': ['sum', 'mean'],       # Sum and mean for 'Sales'
    'Quantity': ['max', 'min']      # Max and min for 'Quantity'
}

result = df.groupby('Store').agg(agg_dict)

display(result)